/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "Статус"; /* Display Name */

"mQr54o" = "неизвестно";   /* Value: unknown */
"8K78Gu" = "Не выполн.";      /* Value: open */
"HSjTOt" = "Выполнено"; /* Value: completed */
"1Ncljt" = "Отменено";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Задача Things"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "Заголовок";     /* Property: title */
"Kw5NWX" = "Список";      /* Property: list */
"R3fuSz" = "Когда";      /* Property: when */
"8TjwzE" = "Вечером";   /* Property: evening */
"gRh7no" = "Нет";        /* Property: evening (false value) */
"WHB5qC" = "Да";       /* Property: evening (true value) */
"bww4JS" = "Напоминание";  /* Property: reminder */
"19lPBk" = "Срок";  /* Property: deadline */
"pp3qBd" = "Заметки";     /* Property: notes */
"UDIc1x" = "Чек-лист"; /* Property: checklist */
"KQzIKq" = "Теги";      /* Property: tags */

/* TINList */

"x7Empa" = "Список Things"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "Добавить задачу"; /* Title */
"1Xn7Aa" = "Добавляет в Things новую задачу."; /* Description */

"YmSQDf" = "Задача"; /* Parameter: title */
"LHHz9E" = "Какой заголовок у задачи?"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "Список"; /* Parameter: list */
"X4r1DR" = "В какой список добавить задачу?"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "Когда"; /* Parameter: when */
"VkNe0C" = "Когда вы хотите начать?"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "Вечером"; /* Parameter: evening */
"b10WOZ" = "Вечером?"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "Нет"; /* Parameter: evening (false value) */
"KWUIrj" = "Да"; /* Parameter: evening (true value) */

"AeXgbS" = "Напоминание"; /* Parameter: reminderTime */
"3Nk1Yl" = "В какое время вам напомнить?"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "Срок"; /* Parameter: deadline */
"xi8sPe" = "Когда крайний срок?"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "Теги"; /* Parameter: tags */
"l0xizU" = "Какие теги нужно добавить?"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "Статус"; /* Parameter: status */
"sS5Ms4" = "Какой статус у задачи?"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "Править в Things"; /* Parameter: editInThings */
"W5N6Yo" = "Открыть Things для редактирования этой задачи?"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "Нет"; /* Parameter: editInThings (false value) */
"ZSGv41" = "Да"; /* Parameter: editInThings (true value) */

"o8AABR" = "Заметки"; /* Parameter: notes */
"pjyLst" = "Какие заметки добавить?"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "Чек-лист"; /* Parameter: checklist */
"VIitBC" = "Какие пункты добавить в чек-лист?"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "Задача «${todoTitle}» добавлена."; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "Задача «${todoTitle}» добавлена."; /* Response Code: success (printed dialog) */
"sr1IRz" = "При добавлении задачи произошел сбой."; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "При добавлении задачи произошел сбой."; /* Response Code: failure (printed dialog) */
"j6LE7B" = "Задача добавлена."; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "Задача добавлена."; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "Заголовок задачи"; /* Response Parameter: todoTitle */
"Br1Zm3" = "Задача"; /* Response Parameter: todo */

"9LylOv" = "Добавить: ${title}"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "Добавить: ${title}"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "Показать задачу"; /* Title */
"JdIZ8x" = "Отображает выбранную задачу в Things."; /* Description */

"WAIq5F" = "Задача"; /* Parameter: todo */

"YIbDyi" = "Показать: ${todo}"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "Показать список"; /* Title */
"xo5PDm" = "Отображает выбранный список в Things."; /* Description */

"RW2Nyz" = "Список"; /* Parameter: list */
"V1nlDA" = "В какой список?"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "Фильтр по тегам"; /* Parameter: filterByTags */
"HQ0TAS" = "Какие теги?"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "Показать: ${list}"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "Показать: ${list}"; /* Shortcuts App: list (title) */

"mlANgr" = "Показать: ${list}"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "Открыть URL Things"; /*  Title */
"keYeZ9" = "Открывает URL-адрес Things в фоновом режиме."; /*  Description */

"uPeA3l" = "URL-адрес Things"; /*  Parameter: url */
"oTrE0f" = "Какой URL?"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "URL-адрес открыт."; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "URL-адрес открыт."; /*  Response Code: success (printed dialog) */
"a4aEdR" = "При выполнении URL-адреса произошел сбой."; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "При выполнении URL-адреса произошел сбой."; /*  Response Code: failure (printed dialog) */

"uth0Px" = "Открыть URL Things ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "Добавить задания"; /* Title */
"J4CdGj" = "Добавляет задачу в Things штатными средствами операционной системы. Поддерживает ограниченный набор параметров."; /* Intent AddTasks -> Description */

"IF3OZi" = "Список заданий"; /* Parameter: targetTaskList */
"uNB8yE" = "Заголовки"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "Открыть Things"; /* Suggestions:  (title) */
